import { defineConfig } from "vite";

// https://vitejs.dev/config
export default defineConfig({
  build: {
    // 💡 Додайте конфігурацію для збірки як бібліотеки (для Main Process)
    lib: {
      // Вкажіть вхідний файл вашого основного процесу
      entry: "src/main.ts", // Замініть на ваш фактичний вхідний файл

      // 🚨 Головний крок: Визначити формат як CommonJS
      formats: ["cjs"],

      // Визначити ім'я вихідного файлу з розширенням .cjs
      fileName: (format) => `main.${format}`, // Це створить main.cjs
    },
    outDir: ".vite/build", // Куди зберігати бандл
    rollupOptions: {
      external: ["keytar"], // Залишаємо зовнішні залежності
    },
  },
});
